tests/k6/results/nominal_20260921_043338.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/mg/mailguard/tests/k6/nominal.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 5m30s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 5m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 02/50 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 02/50 VUs  0m01.0s/5m00.0s

running (0m02.0s), 04/50 VUs, 2 complete and 0 interrupted iterations
default   [   1% ] 04/50 VUs  0m02.0s/5m00.0s

running (0m03.0s), 05/50 VUs, 6 complete and 0 interrupted iterations
default   [   1% ] 05/50 VUs  0m03.0s/5m00.0s

running (0m04.0s), 07/50 VUs, 11 complete and 0 interrupted iterations
default   [   1% ] 07/50 VUs  0m04.0s/5m00.0s

running (0m05.0s), 09/50 VUs, 18 complete and 0 interrupted iterations
default   [   2% ] 09/50 VUs  0m05.0s/5m00.0s

running (0m06.0s), 10/50 VUs, 27 complete and 0 interrupted iterations
default   [   2% ] 10/50 VUs  0m06.0s/5m00.0s

running (0m07.0s), 12/50 VUs, 37 complete and 0 interrupted iterations
default   [   2% ] 12/50 VUs  0m07.0s/5m00.0s

running (0m08.0s), 14/50 VUs, 48 complete and 0 interrupted iterations
default   [   3% ] 14/50 VUs  0m08.0s/5m00.0s

running (0m09.0s), 15/50 VUs, 61 complete and 0 interrupted iterations
default   [   3% ] 15/50 VUs  0m09.0s/5m00.0s

running (0m10.0s), 17/50 VUs, 76 complete and 0 interrupted iterations
default   [   3% ] 17/50 VUs  0m10.0s/5m00.0s

running (0m11.0s), 18/50 VUs, 92 complete and 0 interrupted iterations
default   [   4% ] 18/50 VUs  0m11.0s/5m00.0s

running (0m12.0s), 20/50 VUs, 108 complete and 0 interrupted iterations
default   [   4% ] 20/50 VUs  0m12.0s/5m00.0s

running (0m13.0s), 22/50 VUs, 128 complete and 0 interrupted iterations
default   [   4% ] 22/50 VUs  0m13.0s/5m00.0s

running (0m14.0s), 23/50 VUs, 150 complete and 0 interrupted iterations
default   [   5% ] 23/50 VUs  0m14.0s/5m00.0s

running (0m15.0s), 25/50 VUs, 173 complete and 0 interrupted iterations
default   [   5% ] 25/50 VUs  0m15.0s/5m00.0s

running (0m16.0s), 27/50 VUs, 198 complete and 0 interrupted iterations
default   [   5% ] 27/50 VUs  0m16.0s/5m00.0s

running (0m17.0s), 28/50 VUs, 225 complete and 0 interrupted iterations
default   [   6% ] 28/50 VUs  0m17.0s/5m00.0s

running (0m18.0s), 30/50 VUs, 253 complete and 0 interrupted iterations
default   [   6% ] 30/50 VUs  0m18.0s/5m00.0s

running (0m19.0s), 32/50 VUs, 282 complete and 0 interrupted iterations
default   [   6% ] 32/50 VUs  0m19.0s/5m00.0s

running (0m20.0s), 33/50 VUs, 311 complete and 0 interrupted iterations
default   [   7% ] 33/50 VUs  0m20.0s/5m00.0s

running (0m21.0s), 35/50 VUs, 343 complete and 0 interrupted iterations
default   [   7% ] 35/50 VUs  0m21.0s/5m00.0s

running (0m22.0s), 36/50 VUs, 375 complete and 0 interrupted iterations
default   [   7% ] 36/50 VUs  0m22.0s/5m00.0s

running (0m23.0s), 38/50 VUs, 410 complete and 0 interrupted iterations
default   [   8% ] 38/50 VUs  0m23.0s/5m00.0s

running (0m24.0s), 40/50 VUs, 447 complete and 0 interrupted iterations
default   [   8% ] 40/50 VUs  0m24.0s/5m00.0s

running (0m25.0s), 41/50 VUs, 487 complete and 0 interrupted iterations
default   [   8% ] 41/50 VUs  0m25.0s/5m00.0s

running (0m26.0s), 43/50 VUs, 528 complete and 0 interrupted iterations
default   [   9% ] 43/50 VUs  0m26.0s/5m00.0s

running (0m27.0s), 45/50 VUs, 553 complete and 0 interrupted iterations
default   [   9% ] 45/50 VUs  0m27.0s/5m00.0s

running (0m28.0s), 46/50 VUs, 598 complete and 0 interrupted iterations
default   [   9% ] 46/50 VUs  0m28.0s/5m00.0s

running (0m29.0s), 48/50 VUs, 644 complete and 0 interrupted iterations
default   [  10% ] 48/50 VUs  0m29.0s/5m00.0s

running (0m30.0s), 49/50 VUs, 692 complete and 0 interrupted iterations
default   [  10% ] 49/50 VUs  0m30.0s/5m00.0s

running (0m31.0s), 50/50 VUs, 741 complete and 0 interrupted iterations
default   [  10% ] 50/50 VUs  0m31.0s/5m00.0s

running (0m32.0s), 50/50 VUs, 787 complete and 0 interrupted iterations
default   [  11% ] 50/50 VUs  0m32.0s/5m00.0s

running (0m33.0s), 50/50 VUs, 837 complete and 0 interrupted iterations
default   [  11% ] 50/50 VUs  0m33.0s/5m00.0s

running (0m34.0s), 50/50 VUs, 887 complete and 0 interrupted iterations
default   [  11% ] 50/50 VUs  0m34.0s/5m00.0s

running (0m35.0s), 50/50 VUs, 935 complete and 0 interrupted iterations
default   [  12% ] 50/50 VUs  0m35.0s/5m00.0s

running (0m36.0s), 50/50 VUs, 985 complete and 0 interrupted iterations
default   [  12% ] 50/50 VUs  0m36.0s/5m00.0s

running (0m37.0s), 50/50 VUs, 1034 complete and 0 interrupted iterations
default   [  12% ] 50/50 VUs  0m37.0s/5m00.0s

running (0m38.0s), 50/50 VUs, 1084 complete and 0 interrupted iterations
default   [  13% ] 50/50 VUs  0m38.0s/5m00.0s

running (0m39.0s), 50/50 VUs, 1134 complete and 0 interrupted iterations
default   [  13% ] 50/50 VUs  0m39.0s/5m00.0s

running (0m40.0s), 50/50 VUs, 1184 complete and 0 interrupted iterations
default   [  13% ] 50/50 VUs  0m40.0s/5m00.0s

running (0m41.0s), 50/50 VUs, 1234 complete and 0 interrupted iterations
default   [  14% ] 50/50 VUs  0m41.0s/5m00.0s

running (0m42.0s), 50/50 VUs, 1284 complete and 0 interrupted iterations
default   [  14% ] 50/50 VUs  0m42.0s/5m00.0s

running (0m43.0s), 50/50 VUs, 1334 complete and 0 interrupted iterations
default   [  14% ] 50/50 VUs  0m43.0s/5m00.0s

running (0m44.0s), 50/50 VUs, 1384 complete and 0 interrupted iterations
default   [  15% ] 50/50 VUs  0m44.0s/5m00.0s

running (0m45.0s), 50/50 VUs, 1434 complete and 0 interrupted iterations
default   [  15% ] 50/50 VUs  0m45.0s/5m00.0s

running (0m46.0s), 50/50 VUs, 1479 complete and 0 interrupted iterations
default   [  15% ] 50/50 VUs  0m46.0s/5m00.0s

running (0m47.0s), 50/50 VUs, 1528 complete and 0 interrupted iterations
default   [  16% ] 50/50 VUs  0m47.0s/5m00.0s

running (0m48.0s), 50/50 VUs, 1556 complete and 0 interrupted iterations
default   [  16% ] 50/50 VUs  0m48.0s/5m00.0s

running (0m49.0s), 50/50 VUs, 1606 complete and 0 interrupted iterations
default   [  16% ] 50/50 VUs  0m49.0s/5m00.0s

running (0m50.0s), 50/50 VUs, 1656 complete and 0 interrupted iterations
default   [  17% ] 50/50 VUs  0m50.0s/5m00.0s

running (0m51.0s), 50/50 VUs, 1705 complete and 0 interrupted iterations
default   [  17% ] 50/50 VUs  0m51.0s/5m00.0s

running (0m52.0s), 50/50 VUs, 1755 complete and 0 interrupted iterations
default   [  17% ] 50/50 VUs  0m52.0s/5m00.0s

running (0m53.0s), 50/50 VUs, 1800 complete and 0 interrupted iterations
default   [  18% ] 50/50 VUs  0m53.0s/5m00.0s

running (0m54.0s), 50/50 VUs, 1850 complete and 0 interrupted iterations
default   [  18% ] 50/50 VUs  0m54.0s/5m00.0s

running (0m55.0s), 50/50 VUs, 1900 complete and 0 interrupted iterations
default   [  18% ] 50/50 VUs  0m55.0s/5m00.0s

running (0m56.0s), 50/50 VUs, 1950 complete and 0 interrupted iterations
default   [  19% ] 50/50 VUs  0m56.0s/5m00.0s

running (0m57.0s), 50/50 VUs, 2000 complete and 0 interrupted iterations
default   [  19% ] 50/50 VUs  0m57.0s/5m00.0s

running (0m58.0s), 50/50 VUs, 2049 complete and 0 interrupted iterations
default   [  19% ] 50/50 VUs  0m58.0s/5m00.0s

running (0m59.0s), 50/50 VUs, 2099 complete and 0 interrupted iterations
default   [  20% ] 50/50 VUs  0m59.0s/5m00.0s

running (1m00.0s), 50/50 VUs, 2149 complete and 0 interrupted iterations
default   [  20% ] 50/50 VUs  1m00.0s/5m00.0s

running (1m01.0s), 50/50 VUs, 2199 complete and 0 interrupted iterations
default   [  20% ] 50/50 VUs  1m01.0s/5m00.0s

running (1m02.0s), 50/50 VUs, 2249 complete and 0 interrupted iterations
default   [  21% ] 50/50 VUs  1m02.0s/5m00.0s

running (1m03.0s), 50/50 VUs, 2288 complete and 0 interrupted iterations
default   [  21% ] 50/50 VUs  1m03.0s/5m00.0s

running (1m04.0s), 50/50 VUs, 2333 complete and 0 interrupted iterations
default   [  21% ] 50/50 VUs  1m04.0s/5m00.0s

running (1m05.0s), 50/50 VUs, 2382 complete and 0 interrupted iterations
default   [  22% ] 50/50 VUs  1m05.0s/5m00.0s

running (1m06.0s), 50/50 VUs, 2428 complete and 0 interrupted iterations
default   [  22% ] 50/50 VUs  1m06.0s/5m00.0s

running (1m07.0s), 50/50 VUs, 2462 complete and 0 interrupted iterations
default   [  22% ] 50/50 VUs  1m07.0s/5m00.0s

running (1m08.0s), 50/50 VUs, 2512 complete and 0 interrupted iterations
default   [  23% ] 50/50 VUs  1m08.0s/5m00.0s

running (1m09.0s), 50/50 VUs, 2562 complete and 0 interrupted iterations
default   [  23% ] 50/50 VUs  1m09.0s/5m00.0s

running (1m10.0s), 50/50 VUs, 2611 complete and 0 interrupted iterations
default   [  23% ] 50/50 VUs  1m10.0s/5m00.0s

running (1m11.0s), 50/50 VUs, 2660 complete and 0 interrupted iterations
default   [  24% ] 50/50 VUs  1m11.0s/5m00.0s

running (1m12.0s), 50/50 VUs, 2709 complete and 0 interrupted iterations
default   [  24% ] 50/50 VUs  1m12.0s/5m00.0s

running (1m13.0s), 50/50 VUs, 2758 complete and 0 interrupted iterations
default   [  24% ] 50/50 VUs  1m13.0s/5m00.0s

running (1m14.0s), 50/50 VUs, 2808 complete and 0 interrupted iterations
default   [  25% ] 50/50 VUs  1m14.0s/5m00.0s

running (1m15.0s), 50/50 VUs, 2858 complete and 0 interrupted iterations
default   [  25% ] 50/50 VUs  1m15.0s/5m00.0s

running (1m16.0s), 50/50 VUs, 2908 complete and 0 interrupted iterations
default   [  25% ] 50/50 VUs  1m16.0s/5m00.0s

running (1m17.0s), 50/50 VUs, 2958 complete and 0 interrupted iterations
default   [  26% ] 50/50 VUs  1m17.0s/5m00.0s

running (1m18.0s), 50/50 VUs, 3008 complete and 0 interrupted iterations
default   [  26% ] 50/50 VUs  1m18.0s/5m00.0s

running (1m19.0s), 50/50 VUs, 3058 complete and 0 interrupted iterations
default   [  26% ] 50/50 VUs  1m19.0s/5m00.0s

running (1m20.0s), 50/50 VUs, 3108 complete and 0 interrupted iterations
default   [  27% ] 50/50 VUs  1m20.0s/5m00.0s

running (1m21.0s), 50/50 VUs, 3156 complete and 0 interrupted iterations
default   [  27% ] 50/50 VUs  1m21.0s/5m00.0s

running (1m22.0s), 50/50 VUs, 3205 complete and 0 interrupted iterations
default   [  27% ] 50/50 VUs  1m22.0s/5m00.0s

running (1m23.0s), 50/50 VUs, 3229 complete and 0 interrupted iterations
default   [  28% ] 50/50 VUs  1m23.0s/5m00.0s

running (1m24.0s), 50/50 VUs, 3274 complete and 0 interrupted iterations
default   [  28% ] 50/50 VUs  1m24.0s/5m00.0s

running (1m25.0s), 50/50 VUs, 3319 complete and 0 interrupted iterations
default   [  28% ] 50/50 VUs  1m25.0s/5m00.0s

running (1m26.0s), 50/50 VUs, 3369 complete and 0 interrupted iterations
default   [  29% ] 50/50 VUs  1m26.0s/5m00.0s

running (1m27.0s), 50/50 VUs, 3418 complete and 0 interrupted iterations
default   [  29% ] 50/50 VUs  1m27.0s/5m00.0s

running (1m28.0s), 50/50 VUs, 3468 complete and 0 interrupted iterations
default   [  29% ] 50/50 VUs  1m28.0s/5m00.0s

running (1m29.0s), 50/50 VUs, 3518 complete and 0 interrupted iterations
default   [  30% ] 50/50 VUs  1m29.0s/5m00.0s

running (1m30.0s), 50/50 VUs, 3568 complete and 0 interrupted iterations
default   [  30% ] 50/50 VUs  1m30.0s/5m00.0s

running (1m31.0s), 50/50 VUs, 3618 complete and 0 interrupted iterations
default   [  30% ] 50/50 VUs  1m31.0s/5m00.0s

running (1m32.0s), 50/50 VUs, 3668 complete and 0 interrupted iterations
default   [  31% ] 50/50 VUs  1m32.0s/5m00.0s

running (1m33.0s), 50/50 VUs, 3714 complete and 0 interrupted iterations
default   [  31% ] 50/50 VUs  1m33.0s/5m00.0s

running (1m34.0s), 50/50 VUs, 3763 complete and 0 interrupted iterations
default   [  31% ] 50/50 VUs  1m34.0s/5m00.0s

running (1m35.0s), 50/50 VUs, 3812 complete and 0 interrupted iterations
default   [  32% ] 50/50 VUs  1m35.0s/5m00.0s

running (1m36.0s), 50/50 VUs, 3862 complete and 0 interrupted iterations
default   [  32% ] 50/50 VUs  1m36.0s/5m00.0s

running (1m37.0s), 50/50 VUs, 3912 complete and 0 interrupted iterations
default   [  32% ] 50/50 VUs  1m37.0s/5m00.0s

running (1m38.0s), 50/50 VUs, 3962 complete and 0 interrupted iterations
default   [  33% ] 50/50 VUs  1m38.0s/5m00.0s

running (1m39.0s), 50/50 VUs, 4010 complete and 0 interrupted iterations
default   [  33% ] 50/50 VUs  1m39.0s/5m00.0s

running (1m40.0s), 50/50 VUs, 4027 complete and 0 interrupted iterations
default   [  33% ] 50/50 VUs  1m40.0s/5m00.0s

running (1m41.0s), 50/50 VUs, 4076 complete and 0 interrupted iterations
default   [  34% ] 50/50 VUs  1m41.0s/5m00.0s

running (1m42.0s), 50/50 VUs, 4126 complete and 0 interrupted iterations
default   [  34% ] 50/50 VUs  1m42.0s/5m00.0s

running (1m43.0s), 50/50 VUs, 4176 complete and 0 interrupted iterations
default   [  34% ] 50/50 VUs  1m43.0s/5m00.0s

running (1m44.0s), 50/50 VUs, 4226 complete and 0 interrupted iterations
default   [  35% ] 50/50 VUs  1m44.0s/5m00.0s

running (1m45.0s), 50/50 VUs, 4276 complete and 0 interrupted iterations
default   [  35% ] 50/50 VUs  1m45.0s/5m00.0s

running (1m46.0s), 50/50 VUs, 4326 complete and 0 interrupted iterations
default   [  35% ] 50/50 VUs  1m46.0s/5m00.0s

running (1m47.0s), 50/50 VUs, 4376 complete and 0 interrupted iterations
default   [  36% ] 50/50 VUs  1m47.0s/5m00.0s

running (1m48.0s), 50/50 VUs, 4426 complete and 0 interrupted iterations
default   [  36% ] 50/50 VUs  1m48.0s/5m00.0s

running (1m49.0s), 50/50 VUs, 4476 complete and 0 interrupted iterations
default   [  36% ] 50/50 VUs  1m49.0s/5m00.0s

running (1m50.0s), 50/50 VUs, 4525 complete and 0 interrupted iterations
default   [  37% ] 50/50 VUs  1m50.0s/5m00.0s

running (1m51.0s), 50/50 VUs, 4573 complete and 0 interrupted iterations
default   [  37% ] 50/50 VUs  1m51.0s/5m00.0s

running (1m52.0s), 50/50 VUs, 4622 complete and 0 interrupted iterations
default   [  37% ] 50/50 VUs  1m52.0s/5m00.0s

running (1m53.0s), 50/50 VUs, 4672 complete and 0 interrupted iterations
default   [  38% ] 50/50 VUs  1m53.0s/5m00.0s

running (1m54.0s), 50/50 VUs, 4702 complete and 0 interrupted iterations
default   [  38% ] 50/50 VUs  1m54.0s/5m00.0s

running (1m55.0s), 50/50 VUs, 4751 complete and 0 interrupted iterations
default   [  38% ] 50/50 VUs  1m55.0s/5m00.0s

running (1m56.0s), 50/50 VUs, 4801 complete and 0 interrupted iterations
default   [  39% ] 50/50 VUs  1m56.0s/5m00.0s

running (1m57.0s), 50/50 VUs, 4841 complete and 0 interrupted iterations
default   [  39% ] 50/50 VUs  1m57.0s/5m00.0s

running (1m58.0s), 50/50 VUs, 4891 complete and 0 interrupted iterations
default   [  39% ] 50/50 VUs  1m58.0s/5m00.0s

running (1m59.0s), 50/50 VUs, 4941 complete and 0 interrupted iterations
default   [  40% ] 50/50 VUs  1m59.0s/5m00.0s

running (2m00.0s), 50/50 VUs, 4991 complete and 0 interrupted iterations
default   [  40% ] 50/50 VUs  2m00.0s/5m00.0s

running (2m01.0s), 50/50 VUs, 5041 complete and 0 interrupted iterations
default   [  40% ] 50/50 VUs  2m01.0s/5m00.0s

running (2m02.0s), 50/50 VUs, 5090 complete and 0 interrupted iterations
default   [  41% ] 50/50 VUs  2m02.0s/5m00.0s

running (2m03.0s), 50/50 VUs, 5135 complete and 0 interrupted iterations
default   [  41% ] 50/50 VUs  2m03.0s/5m00.0s

running (2m04.0s), 50/50 VUs, 5185 complete and 0 interrupted iterations
default   [  41% ] 50/50 VUs  2m04.0s/5m00.0s

running (2m05.0s), 50/50 VUs, 5235 complete and 0 interrupted iterations
default   [  42% ] 50/50 VUs  2m05.0s/5m00.0s

running (2m06.0s), 50/50 VUs, 5284 complete and 0 interrupted iterations
default   [  42% ] 50/50 VUs  2m06.0s/5m00.0s

running (2m07.0s), 50/50 VUs, 5311 complete and 0 interrupted iterations
default   [  42% ] 50/50 VUs  2m07.0s/5m00.0s

running (2m08.0s), 50/50 VUs, 5360 complete and 0 interrupted iterations
default   [  43% ] 50/50 VUs  2m08.0s/5m00.0s

running (2m09.0s), 50/50 VUs, 5409 complete and 0 interrupted iterations
default   [  43% ] 50/50 VUs  2m09.0s/5m00.0s

running (2m10.0s), 50/50 VUs, 5458 complete and 0 interrupted iterations
default   [  43% ] 50/50 VUs  2m10.0s/5m00.0s

running (2m11.0s), 50/50 VUs, 5507 complete and 0 interrupted iterations
default   [  44% ] 50/50 VUs  2m11.0s/5m00.0s

running (2m12.0s), 50/50 VUs, 5556 complete and 0 interrupted iterations
default   [  44% ] 50/50 VUs  2m12.0s/5m00.0s

running (2m13.0s), 50/50 VUs, 5606 complete and 0 interrupted iterations
default   [  44% ] 50/50 VUs  2m13.0s/5m00.0s

running (2m14.0s), 50/50 VUs, 5656 complete and 0 interrupted iterations
default   [  45% ] 50/50 VUs  2m14.0s/5m00.0s

running (2m15.0s), 50/50 VUs, 5706 complete and 0 interrupted iterations
default   [  45% ] 50/50 VUs  2m15.0s/5m00.0s

running (2m16.0s), 50/50 VUs, 5756 complete and 0 interrupted iterations
default   [  45% ] 50/50 VUs  2m16.0s/5m00.0s

running (2m17.0s), 50/50 VUs, 5806 complete and 0 interrupted iterations
default   [  46% ] 50/50 VUs  2m17.0s/5m00.0s

running (2m18.0s), 50/50 VUs, 5849 complete and 0 interrupted iterations
default   [  46% ] 50/50 VUs  2m18.0s/5m00.0s

running (2m19.0s), 50/50 VUs, 5898 complete and 0 interrupted iterations
default   [  46% ] 50/50 VUs  2m19.0s/5m00.0s

running (2m20.0s), 50/50 VUs, 5948 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  2m20.0s/5m00.0s

running (2m21.0s), 50/50 VUs, 5996 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  2m21.0s/5m00.0s

running (2m22.0s), 50/50 VUs, 6046 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  2m22.0s/5m00.0s

running (2m23.0s), 50/50 VUs, 6093 complete and 0 interrupted iterations
default   [  48% ] 50/50 VUs  2m23.0s/5m00.0s

running (2m24.0s), 50/50 VUs, 6141 complete and 0 interrupted iterations
default   [  48% ] 50/50 VUs  2m24.0s/5m00.0s

running (2m25.0s), 50/50 VUs, 6191 complete and 0 interrupted iterations
default   [  48% ] 50/50 VUs  2m25.0s/5m00.0s

running (2m26.0s), 50/50 VUs, 6213 complete and 0 interrupted iterations
default   [  49% ] 50/50 VUs  2m26.0s/5m00.0s

running (2m27.0s), 50/50 VUs, 6263 complete and 0 interrupted iterations
default   [  49% ] 50/50 VUs  2m27.0s/5m00.0s

running (2m28.0s), 50/50 VUs, 6313 complete and 0 interrupted iterations
default   [  49% ] 50/50 VUs  2m28.0s/5m00.0s

running (2m29.0s), 50/50 VUs, 6362 complete and 0 interrupted iterations
default   [  50% ] 50/50 VUs  2m29.0s/5m00.0s

running (2m30.0s), 50/50 VUs, 6412 complete and 0 interrupted iterations
default   [  50% ] 50/50 VUs  2m30.0s/5m00.0s

running (2m31.0s), 50/50 VUs, 6462 complete and 0 interrupted iterations
default   [  50% ] 50/50 VUs  2m31.0s/5m00.0s

running (2m32.0s), 50/50 VUs, 6512 complete and 0 interrupted iterations
default   [  51% ] 50/50 VUs  2m32.0s/5m00.0s

running (2m33.0s), 50/50 VUs, 6562 complete and 0 interrupted iterations
default   [  51% ] 50/50 VUs  2m33.0s/5m00.0s

running (2m34.0s), 50/50 VUs, 6612 complete and 0 interrupted iterations
default   [  51% ] 50/50 VUs  2m34.0s/5m00.0s

running (2m35.0s), 50/50 VUs, 6662 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  2m35.0s/5m00.0s

running (2m36.0s), 50/50 VUs, 6712 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  2m36.0s/5m00.0s

running (2m37.0s), 50/50 VUs, 6760 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  2m37.0s/5m00.0s

running (2m38.0s), 50/50 VUs, 6809 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  2m38.0s/5m00.0s

running (2m39.0s), 50/50 VUs, 6841 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  2m39.0s/5m00.0s

running (2m40.0s), 50/50 VUs, 6874 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  2m40.0s/5m00.0s

running (2m41.0s), 50/50 VUs, 6923 complete and 0 interrupted iterations
default   [  54% ] 50/50 VUs  2m41.0s/5m00.0s

running (2m42.0s), 50/50 VUs, 6973 complete and 0 interrupted iterations
default   [  54% ] 50/50 VUs  2m42.0s/5m00.0s

running (2m43.0s), 50/50 VUs, 7023 complete and 0 interrupted iterations
default   [  54% ] 50/50 VUs  2m43.0s/5m00.0s

running (2m44.0s), 50/50 VUs, 7073 complete and 0 interrupted iterations
default   [  55% ] 50/50 VUs  2m44.0s/5m00.0s

running (2m45.0s), 50/50 VUs, 7123 complete and 0 interrupted iterations
default   [  55% ] 50/50 VUs  2m45.0s/5m00.0s

running (2m46.0s), 50/50 VUs, 7172 complete and 0 interrupted iterations
default   [  55% ] 50/50 VUs  2m46.0s/5m00.0s

running (2m47.0s), 50/50 VUs, 7222 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  2m47.0s/5m00.0s

running (2m48.0s), 50/50 VUs, 7270 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  2m48.0s/5m00.0s

running (2m49.0s), 50/50 VUs, 7320 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  2m49.0s/5m00.0s

running (2m50.0s), 50/50 VUs, 7370 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  2m50.0s/5m00.0s

running (2m51.0s), 50/50 VUs, 7386 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  2m51.0s/5m00.0s

running (2m52.0s), 50/50 VUs, 7433 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  2m52.0s/5m00.0s

running (2m53.0s), 50/50 VUs, 7482 complete and 0 interrupted iterations
default   [  58% ] 50/50 VUs  2m53.0s/5m00.0s

running (2m54.0s), 50/50 VUs, 7530 complete and 0 interrupted iterations
default   [  58% ] 50/50 VUs  2m54.0s/5m00.0s

running (2m55.0s), 50/50 VUs, 7580 complete and 0 interrupted iterations
default   [  58% ] 50/50 VUs  2m55.0s/5m00.0s

running (2m56.0s), 50/50 VUs, 7630 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  2m56.0s/5m00.0s

running (2m57.0s), 50/50 VUs, 7679 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  2m57.0s/5m00.0s

running (2m58.0s), 50/50 VUs, 7729 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  2m58.0s/5m00.0s

running (2m59.0s), 50/50 VUs, 7778 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  2m59.0s/5m00.0s

running (3m00.0s), 50/50 VUs, 7828 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  3m00.0s/5m00.0s

running (3m01.0s), 50/50 VUs, 7878 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  3m01.0s/5m00.0s

running (3m02.0s), 50/50 VUs, 7928 complete and 0 interrupted iterations
default   [  61% ] 50/50 VUs  3m02.0s/5m00.0s

running (3m03.0s), 50/50 VUs, 7939 complete and 0 interrupted iterations
default   [  61% ] 50/50 VUs  3m03.0s/5m00.0s

running (3m04.0s), 50/50 VUs, 7989 complete and 0 interrupted iterations
default   [  61% ] 50/50 VUs  3m04.0s/5m00.0s

running (3m05.0s), 50/50 VUs, 8039 complete and 0 interrupted iterations
default   [  62% ] 50/50 VUs  3m05.0s/5m00.0s

running (3m06.0s), 50/50 VUs, 8089 complete and 0 interrupted iterations
default   [  62% ] 50/50 VUs  3m06.0s/5m00.0s

running (3m07.0s), 50/50 VUs, 8139 complete and 0 interrupted iterations
default   [  62% ] 50/50 VUs  3m07.0s/5m00.0s

running (3m08.0s), 50/50 VUs, 8189 complete and 0 interrupted iterations
default   [  63% ] 50/50 VUs  3m08.0s/5m00.0s

running (3m09.0s), 50/50 VUs, 8239 complete and 0 interrupted iterations
default   [  63% ] 50/50 VUs  3m09.0s/5m00.0s

running (3m10.0s), 50/50 VUs, 8289 complete and 0 interrupted iterations
default   [  63% ] 50/50 VUs  3m10.0s/5m00.0s

running (3m11.0s), 50/50 VUs, 8339 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  3m11.0s/5m00.0s

running (3m12.0s), 50/50 VUs, 8388 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  3m12.0s/5m00.0s

running (3m13.0s), 50/50 VUs, 8438 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  3m13.0s/5m00.0s

running (3m14.0s), 50/50 VUs, 8488 complete and 0 interrupted iterations
default   [  65% ] 50/50 VUs  3m14.0s/5m00.0s

running (3m15.0s), 50/50 VUs, 8538 complete and 0 interrupted iterations
default   [  65% ] 50/50 VUs  3m15.0s/5m00.0s

running (3m16.0s), 50/50 VUs, 8587 complete and 0 interrupted iterations
default   [  65% ] 50/50 VUs  3m16.0s/5m00.0s

running (3m17.0s), 50/50 VUs, 8637 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  3m17.0s/5m00.0s

running (3m18.0s), 50/50 VUs, 8686 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  3m18.0s/5m00.0s

running (3m19.0s), 50/50 VUs, 8736 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  3m19.0s/5m00.0s

running (3m20.0s), 50/50 VUs, 8785 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  3m20.0s/5m00.0s

running (3m21.0s), 50/50 VUs, 8834 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  3m21.0s/5m00.0s

running (3m22.0s), 50/50 VUs, 8883 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  3m22.0s/5m00.0s

running (3m23.0s), 50/50 VUs, 8933 complete and 0 interrupted iterations
default   [  68% ] 50/50 VUs  3m23.0s/5m00.0s

running (3m24.0s), 50/50 VUs, 8983 complete and 0 interrupted iterations
default   [  68% ] 50/50 VUs  3m24.0s/5m00.0s

running (3m25.0s), 50/50 VUs, 9033 complete and 0 interrupted iterations
default   [  68% ] 50/50 VUs  3m25.0s/5m00.0s

running (3m26.0s), 50/50 VUs, 9051 complete and 0 interrupted iterations
default   [  69% ] 50/50 VUs  3m26.0s/5m00.0s

running (3m27.0s), 50/50 VUs, 9097 complete and 0 interrupted iterations
default   [  69% ] 50/50 VUs  3m27.0s/5m00.0s

running (3m28.0s), 50/50 VUs, 9146 complete and 0 interrupted iterations
default   [  69% ] 50/50 VUs  3m28.0s/5m00.0s

running (3m29.0s), 50/50 VUs, 9196 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  3m29.0s/5m00.0s

running (3m30.0s), 50/50 VUs, 9246 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  3m30.0s/5m00.0s

running (3m31.0s), 50/50 VUs, 9296 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  3m31.0s/5m00.0s

running (3m32.0s), 50/50 VUs, 9346 complete and 0 interrupted iterations
default   [  71% ] 50/50 VUs  3m32.0s/5m00.0s

running (3m33.0s), 50/50 VUs, 9396 complete and 0 interrupted iterations
default   [  71% ] 50/50 VUs  3m33.0s/5m00.0s

running (3m34.0s), 50/50 VUs, 9445 complete and 0 interrupted iterations
default   [  71% ] 50/50 VUs  3m34.0s/5m00.0s

running (3m35.0s), 50/50 VUs, 9495 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  3m35.0s/5m00.0s

running (3m36.0s), 50/50 VUs, 9545 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  3m36.0s/5m00.0s

running (3m37.0s), 50/50 VUs, 9595 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  3m37.0s/5m00.0s

running (3m38.0s), 50/50 VUs, 9645 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  3m38.0s/5m00.0s

running (3m39.0s), 50/50 VUs, 9668 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  3m39.0s/5m00.0s

running (3m40.0s), 50/50 VUs, 9710 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  3m40.0s/5m00.0s

running (3m41.0s), 50/50 VUs, 9759 complete and 0 interrupted iterations
default   [  74% ] 50/50 VUs  3m41.0s/5m00.0s

running (3m42.0s), 50/50 VUs, 9808 complete and 0 interrupted iterations
default   [  74% ] 50/50 VUs  3m42.0s/5m00.0s

running (3m43.0s), 50/50 VUs, 9857 complete and 0 interrupted iterations
default   [  74% ] 50/50 VUs  3m43.0s/5m00.0s

running (3m44.0s), 50/50 VUs, 9907 complete and 0 interrupted iterations
default   [  75% ] 50/50 VUs  3m44.0s/5m00.0s

running (3m45.0s), 50/50 VUs, 9957 complete and 0 interrupted iterations
default   [  75% ] 50/50 VUs  3m45.0s/5m00.0s

running (3m46.0s), 50/50 VUs, 10007 complete and 0 interrupted iterations
default   [  75% ] 50/50 VUs  3m46.0s/5m00.0s

running (3m47.0s), 50/50 VUs, 10057 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  3m47.0s/5m00.0s

running (3m48.0s), 50/50 VUs, 10107 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  3m48.0s/5m00.0s

running (3m49.0s), 50/50 VUs, 10157 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  3m49.0s/5m00.0s

running (3m50.0s), 50/50 VUs, 10207 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  3m50.0s/5m00.0s

running (3m51.0s), 50/50 VUs, 10257 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  3m51.0s/5m00.0s

running (3m52.0s), 50/50 VUs, 10307 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  3m52.0s/5m00.0s

running (3m53.0s), 50/50 VUs, 10357 complete and 0 interrupted iterations
default   [  78% ] 50/50 VUs  3m53.0s/5m00.0s

running (3m54.0s), 50/50 VUs, 10383 complete and 0 interrupted iterations
default   [  78% ] 50/50 VUs  3m54.0s/5m00.0s

running (3m55.0s), 50/50 VUs, 10429 complete and 0 interrupted iterations
default   [  78% ] 50/50 VUs  3m55.0s/5m00.0s

running (3m56.0s), 50/50 VUs, 10478 complete and 0 interrupted iterations
default   [  79% ] 50/50 VUs  3m56.0s/5m00.0s

running (3m57.0s), 50/50 VUs, 10521 complete and 0 interrupted iterations
default   [  79% ] 50/50 VUs  3m57.0s/5m00.0s

running (3m58.0s), 50/50 VUs, 10570 complete and 0 interrupted iterations
default   [  79% ] 50/50 VUs  3m58.0s/5m00.0s

running (3m59.0s), 50/50 VUs, 10620 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  3m59.0s/5m00.0s

running (4m00.0s), 50/50 VUs, 10670 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  4m00.0s/5m00.0s

running (4m01.0s), 50/50 VUs, 10718 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  4m01.0s/5m00.0s

running (4m02.0s), 50/50 VUs, 10766 complete and 0 interrupted iterations
default   [  81% ] 50/50 VUs  4m02.0s/5m00.0s

running (4m03.0s), 50/50 VUs, 10816 complete and 0 interrupted iterations
default   [  81% ] 50/50 VUs  4m03.0s/5m00.0s

running (4m04.0s), 50/50 VUs, 10866 complete and 0 interrupted iterations
default   [  81% ] 50/50 VUs  4m04.0s/5m00.0s

running (4m05.0s), 50/50 VUs, 10915 complete and 0 interrupted iterations
default   [  82% ] 50/50 VUs  4m05.0s/5m00.0s

running (4m06.0s), 50/50 VUs, 10964 complete and 0 interrupted iterations
default   [  82% ] 50/50 VUs  4m06.0s/5m00.0s

running (4m07.0s), 50/50 VUs, 11013 complete and 0 interrupted iterations
default   [  82% ] 50/50 VUs  4m07.0s/5m00.0s

running (4m08.0s), 50/50 VUs, 11062 complete and 0 interrupted iterations
default   [  83% ] 50/50 VUs  4m08.0s/5m00.0s

running (4m09.0s), 50/50 VUs, 11112 complete and 0 interrupted iterations
default   [  83% ] 50/50 VUs  4m09.0s/5m00.0s

running (4m10.0s), 50/50 VUs, 11162 complete and 0 interrupted iterations
default   [  83% ] 50/50 VUs  4m10.0s/5m00.0s

running (4m11.0s), 50/50 VUs, 11212 complete and 0 interrupted iterations
default   [  84% ] 50/50 VUs  4m11.0s/5m00.0s

running (4m12.0s), 50/50 VUs, 11262 complete and 0 interrupted iterations
default   [  84% ] 50/50 VUs  4m12.0s/5m00.0s

running (4m13.0s), 50/50 VUs, 11312 complete and 0 interrupted iterations
default   [  84% ] 50/50 VUs  4m13.0s/5m00.0s

running (4m14.0s), 50/50 VUs, 11362 complete and 0 interrupted iterations
default   [  85% ] 50/50 VUs  4m14.0s/5m00.0s

running (4m15.0s), 50/50 VUs, 11410 complete and 0 interrupted iterations
default   [  85% ] 50/50 VUs  4m15.0s/5m00.0s

running (4m16.0s), 50/50 VUs, 11460 complete and 0 interrupted iterations
default   [  85% ] 50/50 VUs  4m16.0s/5m00.0s

running (4m17.0s), 50/50 VUs, 11510 complete and 0 interrupted iterations
default   [  86% ] 50/50 VUs  4m17.0s/5m00.0s

running (4m18.0s), 50/50 VUs, 11559 complete and 0 interrupted iterations
default   [  86% ] 50/50 VUs  4m18.0s/5m00.0s

running (4m19.0s), 50/50 VUs, 11608 complete and 0 interrupted iterations
default   [  86% ] 50/50 VUs  4m19.0s/5m00.0s

running (4m20.0s), 50/50 VUs, 11657 complete and 0 interrupted iterations
default   [  87% ] 50/50 VUs  4m20.0s/5m00.0s

running (4m21.0s), 50/50 VUs, 11707 complete and 0 interrupted iterations
default   [  87% ] 50/50 VUs  4m21.0s/5m00.0s

running (4m22.0s), 50/50 VUs, 11757 complete and 0 interrupted iterations
default   [  87% ] 50/50 VUs  4m22.0s/5m00.0s

running (4m23.0s), 50/50 VUs, 11798 complete and 0 interrupted iterations
default   [  88% ] 50/50 VUs  4m23.0s/5m00.0s

running (4m24.0s), 50/50 VUs, 11827 complete and 0 interrupted iterations
default   [  88% ] 50/50 VUs  4m24.0s/5m00.0s

running (4m25.0s), 50/50 VUs, 11877 complete and 0 interrupted iterations
default   [  88% ] 50/50 VUs  4m25.0s/5m00.0s

running (4m26.0s), 50/50 VUs, 11926 complete and 0 interrupted iterations
default   [  89% ] 50/50 VUs  4m26.0s/5m00.0s

running (4m27.0s), 50/50 VUs, 11975 complete and 0 interrupted iterations
default   [  89% ] 50/50 VUs  4m27.0s/5m00.0s

running (4m28.0s), 50/50 VUs, 12023 complete and 0 interrupted iterations
default   [  89% ] 50/50 VUs  4m28.0s/5m00.0s

running (4m29.0s), 50/50 VUs, 12073 complete and 0 interrupted iterations
default   [  90% ] 50/50 VUs  4m29.0s/5m00.0s

running (4m30.0s), 50/50 VUs, 12122 complete and 0 interrupted iterations
default   [  90% ] 50/50 VUs  4m30.0s/5m00.0s

running (4m31.0s), 50/50 VUs, 12172 complete and 0 interrupted iterations
default   [  90% ] 50/50 VUs  4m31.0s/5m00.0s

running (4m32.0s), 48/50 VUs, 12221 complete and 0 interrupted iterations
default   [  91% ] 48/50 VUs  4m32.0s/5m00.0s

running (4m33.0s), 46/50 VUs, 12269 complete and 0 interrupted iterations
default   [  91% ] 46/50 VUs  4m33.0s/5m00.0s

running (4m34.0s), 45/50 VUs, 12315 complete and 0 interrupted iterations
default   [  91% ] 45/50 VUs  4m34.0s/5m00.0s

running (4m35.0s), 43/50 VUs, 12359 complete and 0 interrupted iterations
default   [  92% ] 43/50 VUs  4m35.0s/5m00.0s

running (4m36.0s), 42/50 VUs, 12380 complete and 0 interrupted iterations
default   [  92% ] 42/50 VUs  4m36.0s/5m00.0s

running (4m37.0s), 40/50 VUs, 12416 complete and 0 interrupted iterations
default   [  92% ] 40/50 VUs  4m37.0s/5m00.0s

running (4m38.0s), 38/50 VUs, 12456 complete and 0 interrupted iterations
default   [  93% ] 38/50 VUs  4m38.0s/5m00.0s

running (4m39.0s), 37/50 VUs, 12494 complete and 0 interrupted iterations
default   [  93% ] 37/50 VUs  4m39.0s/5m00.0s

running (4m40.0s), 35/50 VUs, 12529 complete and 0 interrupted iterations
default   [  93% ] 35/50 VUs  4m40.0s/5m00.0s

running (4m41.0s), 34/50 VUs, 12563 complete and 0 interrupted iterations
default   [  94% ] 34/50 VUs  4m41.0s/5m00.0s

running (4m42.0s), 32/50 VUs, 12597 complete and 0 interrupted iterations
default   [  94% ] 32/50 VUs  4m42.0s/5m00.0s

running (4m43.0s), 29/50 VUs, 12629 complete and 0 interrupted iterations
default   [  94% ] 29/50 VUs  4m43.0s/5m00.0s

running (4m44.0s), 27/50 VUs, 12658 complete and 0 interrupted iterations
default   [  95% ] 27/50 VUs  4m44.0s/5m00.0s

running (4m45.0s), 26/50 VUs, 12684 complete and 0 interrupted iterations
default   [  95% ] 26/50 VUs  4m45.0s/5m00.0s

running (4m46.0s), 25/50 VUs, 12710 complete and 0 interrupted iterations
default   [  95% ] 25/50 VUs  4m46.0s/5m00.0s

running (4m47.0s), 23/50 VUs, 12735 complete and 0 interrupted iterations
default   [  96% ] 23/50 VUs  4m47.0s/5m00.0s

running (4m48.0s), 21/50 VUs, 12758 complete and 0 interrupted iterations
default   [  96% ] 21/50 VUs  4m48.0s/5m00.0s

running (4m49.0s), 20/50 VUs, 12779 complete and 0 interrupted iterations
default   [  96% ] 20/50 VUs  4m49.0s/5m00.0s

running (4m50.0s), 18/50 VUs, 12799 complete and 0 interrupted iterations
default   [  97% ] 18/50 VUs  4m50.0s/5m00.0s

running (4m51.0s), 16/50 VUs, 12817 complete and 0 interrupted iterations
default   [  97% ] 16/50 VUs  4m51.0s/5m00.0s

running (4m52.0s), 14/50 VUs, 12832 complete and 0 interrupted iterations
default   [  97% ] 14/50 VUs  4m52.0s/5m00.0s

running (4m53.0s), 13/50 VUs, 12846 complete and 0 interrupted iterations
default   [  98% ] 13/50 VUs  4m53.0s/5m00.0s

running (4m54.0s), 11/50 VUs, 12859 complete and 0 interrupted iterations
default   [  98% ] 11/50 VUs  4m54.0s/5m00.0s

running (4m55.0s), 09/50 VUs, 12870 complete and 0 interrupted iterations
default   [  98% ] 09/50 VUs  4m55.0s/5m00.0s

running (4m56.0s), 08/50 VUs, 12879 complete and 0 interrupted iterations
default   [  99% ] 08/50 VUs  4m56.0s/5m00.0s

running (4m57.0s), 06/50 VUs, 12887 complete and 0 interrupted iterations
default   [  99% ] 06/50 VUs  4m57.0s/5m00.0s

running (4m58.0s), 05/50 VUs, 12891 complete and 0 interrupted iterations
default   [  99% ] 05/50 VUs  4m58.0s/5m00.0s

running (4m59.0s), 04/50 VUs, 12896 complete and 0 interrupted iterations
default   [ 100% ] 04/50 VUs  4m59.0s/5m00.0s

running (5m00.0s), 01/50 VUs, 12900 complete and 0 interrupted iterations
default   [ 100% ] 01/50 VUs  5m00.0s/5m00.0s

running (5m01.0s), 00/50 VUs, 12901 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  5m0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<200' p(95)=112.22ms
    ✓ 'p(99)<500' p(99)=139.07ms

    http_req_failed
    ✓ 'rate==0' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 38703   128.596973/s
    checks_succeeded...: 100.00% 38703 out of 38703
    checks_failed......: 0.00%   0 out of 38703

    ✓ status 200
    ✓ verdict present
    ✓ score dans [0,100]

    HTTP
    http_req_duration..............: avg=47.21ms min=4.19ms med=38.03ms max=250.99ms p(90)=96.56ms p(95)=112.22ms p(99)=139.07ms
      { expected_response:true }...: avg=47.21ms min=4.19ms med=38.03ms max=250.99ms p(90)=96.56ms p(95)=112.22ms p(99)=139.07ms
    http_req_failed................: 0.00%  0 out of 12901
    http_reqs......................: 12901  42.865658/s

    EXECUTION
    iteration_duration.............: avg=1.04s   min=1s     med=1.04s   max=1.25s    p(90)=1.1s    p(95)=1.11s    p(99)=1.14s   
    iterations.....................: 12901  42.865658/s
    vus............................: 1      min=1          max=50
    vus_max........................: 50     min=50         max=50

    NETWORK
    data_received..................: 25 MB  84 kB/s
    data_sent......................: 3.0 MB 10 kB/s



running (5m01.0s), 00/50 VUs, 12901 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  5m0s
====================================================================
 SLI mesurés côté serveur (Prometheus) — scénario nominal
====================================================================
 fenêtre          : 04:33:38 -> 04:38:40 (302 s)
 requêtes /verify : 13380
 latence P95      : 93 ms
 latence P99      : 152 ms
 erreurs 5xx      : 0.000 %  (disponibilité 100.000 %)
 cache hit ratio  : 0.0 %  (0 hits / 13380)
 pods API         : 4 prêts, 4 scrapés (une série par pod)
====================================================================